Lottery.init({
	//anonymous: false,
	//auto: true,
	awards: [
		{"index": 3, "name": "三等奖", "amount": 40},
		{"index": 2, "name": "二等奖", "amount": 20},
		{"index": 1, "name": "一等奖", "amount": 4},
		{"index": 9, "name": "特等奖", "amount": 2},
		{"index": 0, "name": "幸运奖", "amount": 1}
	],
	//client: true,
	cover: "images/item.jpg",
	donate: function(id) {
		alert("donate: " + id);

/*
		$.ajax({
			type: "POST",
			url: "ajax.jsp",
			data: {
				"action": "donate",
				"id": id
			},
			dataType: "json",
			success: function(data) {}
		});
*/
	},
	generate: function(callback, award) {
/*
		$.ajax({
			type: "POST",
			url: "ajax.jsp",
			data: {
				"action": "lucky",
				"award": award
			},
			dataType: "json",
			success: function(data) {
*/
				var
				data = {"id": 1, "name": "winner"},

				ext = ".jpg",
				path = "";

				callback({
					"id": data["id"],
					"name": data["name"],
					"src": path + data["name"] + ext
				});
/*
			}
		});
*/
	},
/*
	players: (function() {
		var
		data = [],

		names = ["中央市场部-孙天瑶", "中央市场部-张航", "中央市场部-张逸飞", "中央市场部-李金华", "中央市场部-林胜男", "中央市场部-王欣", "中央市场部-秦鹏", "中央市场部-蔺晓琴", "中央市场部-贝霞", "亲子网销售部-刘勤鹏", "亲子网销售部-卢亚宁", "亲子网销售部-王红", "亲子网销售部-陈晓晶", "信息部-倪利利", "信息部-张盼", "信息部-杜博", "信息部-褚颖", "信息部-赵冰", "信息部-赵雪娜", "信息部-郭清", "信息部-黄雯", "北京研发中心-付海兰", "北京研发中心-付鹏霞", "北京研发中心-刘恋", "北京研发中心-刘颖文", "北京研发中心-周宁", "北京研发中心-孙健炜", "北京研发中心-宋美杰", "北京研发中心-李鑫", "北京研发中心-杨川", "北京研发中心-池翔", "北京研发中心-王娜音", "北京研发中心-秦卓娜", "北京研发中心-董政", "北京研发中心-赵玮", "北京研发中心-陈自新", "北京研发中心-马岩", "北京研发中心-魏崟", "北京研发中心-黄伟娜", "女性网编辑部-仲桦", "女性网编辑部-刘湲", "女性网编辑部-刘珊珊", "女性网编辑部-吴彬", "女性网编辑部-张萌", "女性网编辑部-李艾", "女性网编辑部-贾然", "女性网编辑部-辜晓钰", "女性网销售部-付冰", "女性网销售部-何雪", "女性网销售部-刘婷", "女性网销售部-刘爽", "女性网销售部-吴姗姗", "女性网销售部-吴欣欣", "女性网销售部-孙慧梅", "女性网销售部-康诗文", "女性网销售部-杨文涛", "女性网销售部-杨晓齐", "女性网销售部-梁红", "女性网销售部-梅苏", "女性网销售部-欧阳宏雨", "女性网销售部-浦炯晔", "女性网销售部-田珍", "女性网销售部-胡松", "女性网销售部-贾明", "女性网销售部-陈岩光", "女性网销售部-马玥", "家居网编辑部-刘忆楠", "家居网编辑部-吴烨", "家居网编辑部-周健", "家居网编辑部-张晶晶", "家居网编辑部-张觅", "家居网编辑部-张雪元", "家居网编辑部-朱冬熳", "家居网编辑部-李楠", "家居网编辑部-汪一旸", "家居网编辑部-王思几", "家居网编辑部-邓迪", "家居网编辑部-黄祎", "家居网销售部-孙巍", "8家居网销售部-张瑾", "8家居网销售部-李盈", "8家居网销售部-李辰超", "8家居网销售部-黄硕", "工程部-周海峰", "工程部-张金贵", "工程部-李乃国", "工程部-李跃宏", "工程部-王亚明", "总裁办-李安云", "汽车网市场部-徐恺", "汽车网编辑部-刘明辉", "汽车网编辑部-刘石磊", "汽车网编辑部-孙铂龙", "汽车网编辑部-李佳", "汽车网编辑部-毕盈", "汽车网编辑部-王硕", "汽车网销售部厂商组-于晗", "汽车网销售部厂商组-于红颖", "汽车网销售部厂商组-史小军", "汽车网销售部厂商组-周廉平", "汽车网销售部厂商组-周金雯", "汽车网销售部厂商组-安玉姝", "汽车网销售部厂商组-张萌", "汽车网销售部厂商组-战强", "汽车网销售部厂商组-王丽佳", "汽车网销售部厂商组-申航", "汽车网销售部厂商组-见翠", "汽车网销售部厂商组-马晓雷", "汽车网销售部厂商组-黄康", "汽车网销售部渠道组-刘云", "汽车网销售部渠道组-崔琍", "汽车网销售部渠道组-张显波", "汽车网销售部渠道组-朱潇智", "汽车网销售部渠道组-李泉", "汽车网销售部渠道组-武竞", "汽车网销售部渠道组-王嘉文", "汽车网销售部渠道组-郭军成", "汽车网销售部渠道组-钟赫峥", "汽车网销售部移动产品组-李想", "汽车网销售部移动产品组-李欣蔚", "汽车网销售部移动产品组-路华", "汽车网销售部移动产品组-邱云龙", "游戏网销售部-戴军辉", "游戏网销售部-明玉敬", "游戏网销售部-王琤", "游戏网销售部-程诚", "游戏网销售部-郑薇薇", "电脑网编辑部-付涛", "电脑网编辑部-冉广", "电脑网编辑部-刘晓辉", "电脑网编辑部-尤飞龙", "电脑网编辑部-左键", "电脑网编辑部-李懿", "电脑网编辑部-李捷", "电脑网编辑部-杨涛", "电脑网编辑部-柳杨", "电脑网编辑部-熊雪辉", "电脑网编辑部-王丞", "电脑网编辑部-王君", "电脑网编辑部-王明达", "电脑网编辑部-王首立", "电脑网编辑部-盛永振", "电脑网编辑部-贺杰", "电脑网编辑部-陈占伟", "电脑网编辑部-陈志", "电脑网编辑部-黄星", "电脑网销售部厂商组-于园园", "电脑网销售部厂商组-依茜", "电脑网销售部厂商组-关悦", "电脑网销售部厂商组-刘嘉玉", "电脑网销售部厂商组-刘惠", "电脑网销售部厂商组-刘阳", "电脑网销售部厂商组-周艺颖", "电脑网销售部厂商组-姜文倩", "电脑网销售部厂商组-庄英", "电脑网销售部厂商组-张丽媛", "电脑网销售部厂商组-张影", "电脑网销售部厂商组-张杉", "电脑网销售部厂商组-张莹", "电脑网销售部厂商组-徐霏", "电脑网销售部厂商组-李斯", "电脑网销售部厂商组-李旎", "电脑网销售部厂商组-杨璟瑜", "电脑网销售部厂商组-王然", "电脑网销售部厂商组-申妮妮", "电脑网销售部厂商组-莫莉", "电脑网销售部厂商组-董嘉", "电脑网销售部厂商组-赵丹丹", "电脑网销售部厂商组-赵云燕", "电脑网销售部厂商组-赵劼", "电脑网销售部厂商组-赵思蕤", "电脑网销售部厂商组-郝倩", "电脑网销售部厂商组-郭沛林", "电脑网销售部厂商组-郭潇", "电脑网销售部厂商组-陆舒舒", "电脑网销售部厂商组-马羽", "电脑网销售部厂商组-马超", "电脑网销售部厂商组-高新", "电脑网销售部厂商组-高翔", "电脑网销售部渠道组-屈宁波", "电脑网销售部渠道组-曲洋洋", "电脑网销售部渠道组-杨杨", "电脑网销售部渠道组-武利坤", "电脑网销售部渠道组-沙圆圆", "电脑网销售部渠道组-渠志伟", "电脑网销售部渠道组-邵政淇", "电脑网销售部渠道组-郭珺", "电脑网销售部渠道组-陈玉雪", "管理部-张志才", "管理部-施容", "管理部-李靖", "管理部-牛海洋", "管理部-胡宛乔", "管理部-陈文珍", "管理部-韩合法", "行政部-刘永贵", "行政部-孙彦萍", "行政部-张卫宾", "行政部-徐帆", "行政部-李爽", "行政部-王晓俊", "行政部-王晓媛", "行政部-董丽华", "行政部-陈国祥", "财务部-汤以欣", "财务部-王艳春", "财务部-贾云莉", "财务部-赵艳红", "资金部-张卫平", "资金部-张静", "资金部-李国侠", "资金部-王海莲"],

		ext = ".jpg",
		path = "players/";

		for (var item, i = 0, l = names.length; i < l; i++) {
			item = names[i];

			data.push({
				"id": i + 1,
				"name": item,
				"src": path + item + ext
			});
		}

		return data;
	})(),
*/
	positions: [
		/* "P" (w: 1200px) */
		"-4200px, 0px, 0px",
		"-4000px, 0px, 0px",
		"-4200px, 200px, 0px",
		"-4000px, 200px, 0px",
		"-4200px, 400px, 0px",
		"-4000px, 400px, 0px",
		"-4200px, 600px, 0px",
		"-4000px, 600px, 0px",
		"-4200px, 800px, 0px",
		"-4000px, 800px, 0px",
		"-4200px, 1000px, 0px",
		"-4000px, 1000px, 0px",
		"-4200px, 1200px, 0px",
		"-4000px, 1200px, 0px",
		"-4200px, 1400px, 0px",
		"-4000px, 1400px, 0px",

		"-3800px, 0px, 0px",
		"-3800px, 200px, 0px",
		"-3600px, 0px, 0px",
		"-3600px, 200px, 0px",
		"-3400px, 0px, 0px",
		"-3400px, 200px, 0px",
		"-3200px, 100px, 0px",
		"-3200px, 300px, 0px",
		"-3000px, 200px, 0px",
		"-3000px, 400px, 0px",
		"-3000px, 600px, 0px",
		"-3000px, 800px, 0px",
		"-3200px, 700px, 0px",
		"-3200px, 900px, 0px",
		"-3400px, 800px, 0px",
		"-3400px, 1000px, 0px",
		"-3600px, 800px, 0px",
		"-3600px, 1000px, 0px",
		"-3800px, 800px, 0px",
		"-3800px, 1000px, 0px",

		/* "C" (w: 1300px) */
		"-1400px, 300px, 0px",
		"-1500px, 100px, 0px",
		"-1600px, 300px, 0px",
		"-1700px, 100px, 0px",
		"-1900px, 0px, 0px",
		"-2100px, 0px, 0px",
		"-2300px, 100px, 0px",
		"-2500px, 100px, 0px",
		"-2600px, 300px, 0px",
		"-2400px, 300px, 0px",
		"-2700px, 500px, 0px",
		"-2500px, 500px, 0px",
		"-2700px, 700px, 0px",
		"-2500px, 700px, 0px",
		"-2700px, 900px, 0px",
		"-2500px, 900px, 0px",
		"-2600px, 1100px, 0px",
		"-2400px, 1100px, 0px",
		"-2500px, 1300px, 0px",
		"-2300px, 1300px, 0px",
		"-2100px, 1400px, 0px",
		"-1900px, 1400px, 0px",
		"-1700px, 1300px, 0px",
		"-1500px, 1300px, 0px",
		"-1600px, 1100px, 0px",
		"-1400px, 1100px, 0px",

		/* "G" (w: 900px) */
		"-200px, 500px, 0px",
		"-400px, 400px, 0px",
		"-600px, 400px, 0px",
		"-800px, 500px, 0px",
		"-1000px, 600px, 0px",
		"-1100px, 800px, 0px",
		"-1100px, 1000px, 0px",
		"-1000px, 1200px, 0px",
		"-800px, 1300px, 0px",
		"-600px, 1400px, 0px",
		"-400px, 1400px, 0px",
		"-200px, 1300px, 0px",
		"-200px, 1100px, 0px",
		"-200px, 900px, 0px",
		"-400px, 900px, 0px",
		"-600px, 900px, 0px",

		/* "R" (w: 500px) */
		"100px, 400px, 0px",
		"100px, 600px, 0px",
		"100px, 800px, 0px",
		"100px, 1000px, 0px",
		"100px, 1200px, 0px",
		"100px, 1400px, 0px",

		"300px, 400px, 0px",
		"500px, 400px, 0px",
		"700px, 500px, 0px",
		"800px, 700px, 0px",
		"700px, 900px, 0px",
		"500px, 1000px, 0px",
		"300px, 1000px, 0px",

		"600px, 1200px, 0px",
		"700px, 1300px, 0px",
		"800px, 1400px, 0px",

		/* "O" (w: 1000px) */
		"1600px, 400px, 0px",
		"1400px, 500px, 0px",
		"1200px, 700px, 0px",
		"1100px, 900px, 0px",
		"1200px, 1100px, 0px",
		"1400px, 1300px, 0px",
		"1600px, 1400px, 0px",
		"1800px, 1300px, 0px",
		"2000px, 1100px, 0px",
		"2100px, 900px, 0px",
		"2000px, 700px, 0px",
		"1800px, 500px, 0px",

		/* "U" (w: 800px) */
		"2400px, 600px, 0px",
		"2400px, 800px, 0px",
		"2400px, 1000px, 0px",
		"2400px, 1200px, 0px",
		"2500px, 1300px, 0px",
		"2700px, 1400px, 0px",
		"2900px, 1400px, 0px",
		"3100px, 1300px, 0px",
		"3200px, 1200px, 0px",
		"3200px, 1000px, 0px",
		"3200px, 800px, 0px",
		"3200px, 600px, 0px",

		/* "P" (w: 800px) */
		"3500px, 400px, 0px",
		"3500px, 600px, 0px",
		"3500px, 800px, 0px",
		"3500px, 1000px, 0px",
		"3500px, 1200px, 0px",
		"3500px, 1400px, 0px",

		"3700px, 400px, 0px",
		"3900px, 400px, 0px",
		"4100px, 400px, 0px",
		"4200px, 500px, 0px",
		"4300px, 600px, 0px",
		"4300px, 800px, 0px",
		"4200px, 900px, 0px",
		"4100px, 1000px, 0px",
		"3900px, 1000px, 0px",
		"3700px, 1000px, 0px",

		/* "cube" */
		"2800px, 600px, 0px",
		"2600px, 400px, 0px",
		"2800px, 400px, 0px",
		"3000px, 400px, 0px",
		"3200px, 200px, 0px",
		"3000px, 200px, 0px",
		"2800px, 200px, 0px",
		"2600px, 200px, 0px",
		"2400px, 200px, 0px",
		"2200px, 0px, 0px",
		"2400px, 0px, 0px",
		"2600px, 0px, 0px",
		"2800px, 0px, 0px",
		"3000px, 0px, 0px",
		"3200px, 0px, 0px",
		"3400px, 0px, 0px",
		"3400px, -200px, 0px",
		"3200px, -200px, 0px",
		"3000px, -200px, 0px",
		"2800px, -200px, 0px",
		"2600px, -200px, 0px",
		"2400px, -200px, 0px",
		"2200px, -200px, 0px",
		"2200px, -400px, 0px",
		"2400px, -400px, 0px",
		"2600px, -400px, 0px",
		"2800px, -400px, 0px",
		"3000px, -400px, 0px",
		"3200px, -400px, 0px",
		"3400px, -400px, 0px",
		"3400px, -600px, 0px",
		"3200px, -600px, 0px",
		"3000px, -600px, 0px",
		"2800px, -600px, 0px",
		"2600px, -600px, 0px",
		"2400px, -600px, 0px",
		"2200px, -600px, 0px",
		"2400px, -800px, 0px",
		"2600px, -800px, 0px",
		"2800px, -800px, 0px",
		"3000px, -800px, 0px",
		"3200px, -800px, 0px",
		"3000px, -1000px, 0px",
		"2800px, -1000px, 0px",
		"2600px, -1000px, 0px",
		"2800px, -1200px, 0px"
	],
	//total: 100
});
