//$(function() {

	lottery.init({
		//anonymous: false,
		//auto: true,
		awards: [
			{"index": 3, "name": "三等奖", "amount": 40},
			{"index": 2, "name": "二等奖", "amount": 20},
			{"index": 1, "name": "一等奖", "amount": 4},
			{"index": 9, "name": "特等奖", "amount": 2},
			{"index": 0, "name": "幸运奖", "amount": 1}
		],
		//client: true,
		donate: function(id) {
			alert("id: " + id);

/*
			$.ajax({
				type: "POST",
				url: "ajax.jsp",
				data: {
					"method": "donate",
					"id": id
				},
				dataType: "json",
				success: function(data) {
				}
			});
*/
		},
/*
		players: (function() {
			var
			data = [{"id":1,"name":"中央市场部-孙天瑶"},{"id":2,"name":"中央市场部-张航"},{"id":3,"name":"中央市场部-张逸飞"},{"id":4,"name":"中央市场部-李金华"},{"id":5,"name":"中央市场部-林胜男"},{"id":6,"name":"中央市场部-王欣"},{"id":7,"name":"中央市场部-秦鹏"},{"id":8,"name":"中央市场部-蔺晓琴"},{"id":9,"name":"中央市场部-贝霞"},{"id":10,"name":"亲子网销售部-刘勤鹏"},{"id":11,"name":"亲子网销售部-卢亚宁"},{"id":12,"name":"亲子网销售部-王红"},{"id":13,"name":"亲子网销售部-陈晓晶"},{"id":14,"name":"信息部-倪利利"},{"id":15,"name":"信息部-张盼"},{"id":16,"name":"信息部-杜博"},{"id":17,"name":"信息部-褚颖"},{"id":18,"name":"信息部-赵冰"},{"id":19,"name":"信息部-赵雪娜"},{"id":20,"name":"信息部-郭清"},{"id":21,"name":"信息部-黄雯"},{"id":22,"name":"北京研发中心-付海兰"},{"id":23,"name":"北京研发中心-付鹏霞"},{"id":24,"name":"北京研发中心-刘恋"},{"id":25,"name":"北京研发中心-刘颖文"},{"id":26,"name":"北京研发中心-周宁"},{"id":27,"name":"北京研发中心-孙健炜"},{"id":28,"name":"北京研发中心-宋美杰"},{"id":29,"name":"北京研发中心-李鑫"},{"id":30,"name":"北京研发中心-杨川"},{"id":31,"name":"北京研发中心-池翔"},{"id":32,"name":"北京研发中心-王娜音"},{"id":33,"name":"北京研发中心-秦卓娜"},{"id":34,"name":"北京研发中心-董政"},{"id":35,"name":"北京研发中心-赵玮"},{"id":36,"name":"北京研发中心-陈自新"},{"id":37,"name":"北京研发中心-马岩"},{"id":38,"name":"北京研发中心-魏崟"},{"id":39,"name":"北京研发中心-黄伟娜"},{"id":40,"name":"女性网编辑部-仲桦"},{"id":41,"name":"女性网编辑部-刘湲"},{"id":42,"name":"女性网编辑部-刘珊珊"},{"id":43,"name":"女性网编辑部-吴彬"},{"id":44,"name":"女性网编辑部-张萌"},{"id":45,"name":"女性网编辑部-李艾"},{"id":46,"name":"女性网编辑部-贾然"},{"id":47,"name":"女性网编辑部-辜晓钰"},{"id":48,"name":"女性网销售部-付冰"},{"id":49,"name":"女性网销售部-何雪"},{"id":50,"name":"女性网销售部-刘婷"},{"id":51,"name":"女性网销售部-刘爽"},{"id":52,"name":"女性网销售部-吴姗姗"},{"id":53,"name":"女性网销售部-吴欣欣"},{"id":54,"name":"女性网销售部-孙慧梅"},{"id":55,"name":"女性网销售部-康诗文"},{"id":56,"name":"女性网销售部-杨文涛"},{"id":57,"name":"女性网销售部-杨晓齐"},{"id":58,"name":"女性网销售部-梁红"},{"id":59,"name":"女性网销售部-梅苏"},{"id":60,"name":"女性网销售部-欧阳宏雨"},{"id":61,"name":"女性网销售部-浦炯晔"},{"id":62,"name":"女性网销售部-田珍"},{"id":63,"name":"女性网销售部-胡松"},{"id":64,"name":"女性网销售部-贾明"},{"id":65,"name":"女性网销售部-陈岩光"},{"id":66,"name":"女性网销售部-马玥"},{"id":67,"name":"家居网编辑部-刘忆楠"},{"id":68,"name":"家居网编辑部-吴烨"},{"id":69,"name":"家居网编辑部-周健"},{"id":70,"name":"家居网编辑部-张晶晶"},{"id":71,"name":"家居网编辑部-张觅 "},{"id":72,"name":"家居网编辑部-张雪元"},{"id":73,"name":"家居网编辑部-朱冬熳"},{"id":74,"name":"家居网编辑部-李楠"},{"id":75,"name":"家居网编辑部-汪一旸"},{"id":76,"name":"家居网编辑部-王思几"},{"id":77,"name":"家居网编辑部-邓迪"},{"id":78,"name":"家居网编辑部-黄祎"},{"id":79,"name":"家居网销售部-孙巍"},{"id":80,"name":"家居网销售部-张瑾"},{"id":81,"name":"家居网销售部-李盈"},{"id":82,"name":"家居网销售部-李辰超"},{"id":83,"name":"家居网销售部-黄硕"},{"id":84,"name":"工程部-周海峰"},{"id":85,"name":"工程部-张金贵"},{"id":86,"name":"工程部-李乃国"},{"id":87,"name":"工程部-李跃宏"},{"id":88,"name":"工程部-王亚明"},{"id":89,"name":"总裁办-李安云"},{"id":90,"name":"汽车网市场部-徐恺"},{"id":91,"name":"汽车网编辑部-刘明辉"},{"id":92,"name":"汽车网编辑部-刘石磊"},{"id":93,"name":"汽车网编辑部-孙铂龙"},{"id":94,"name":"汽车网编辑部-李佳"},{"id":95,"name":"汽车网编辑部-毕盈"},{"id":96,"name":"汽车网编辑部-王硕"},{"id":97,"name":"汽车网销售部厂商组-于晗"},{"id":98,"name":"汽车网销售部厂商组-于红颖"},{"id":99,"name":"汽车网销售部厂商组-史小军"},{"id":100,"name":"汽车网销售部厂商组-周廉平"},{"id":101,"name":"汽车网销售部厂商组-周金雯"},{"id":102,"name":"汽车网销售部厂商组-安玉姝"},{"id":103,"name":"汽车网销售部厂商组-张萌"},{"id":104,"name":"汽车网销售部厂商组-战强"},{"id":105,"name":"汽车网销售部厂商组-王丽佳"},{"id":106,"name":"汽车网销售部厂商组-申航"},{"id":107,"name":"汽车网销售部厂商组-见翠"},{"id":108,"name":"汽车网销售部厂商组-马晓雷"},{"id":109,"name":"汽车网销售部厂商组-黄康"},{"id":110,"name":"汽车网销售部渠道组-刘云"},{"id":111,"name":"汽车网销售部渠道组-崔琍"},{"id":112,"name":"汽车网销售部渠道组-张显波"},{"id":113,"name":"汽车网销售部渠道组-朱潇智"},{"id":114,"name":"汽车网销售部渠道组-李泉"},{"id":115,"name":"汽车网销售部渠道组-武竞"},{"id":116,"name":"汽车网销售部渠道组-王嘉文"},{"id":117,"name":"汽车网销售部渠道组-郭军成"},{"id":118,"name":"汽车网销售部渠道组-钟赫峥"},{"id":119,"name":"汽车网销售部移动产品组-李想"},{"id":120,"name":"汽车网销售部移动产品组-李欣蔚"},{"id":121,"name":"汽车网销售部移动产品组-路华"},{"id":122,"name":"汽车网销售部移动产品组-邱云龙"},{"id":123,"name":"游戏网销售部-戴军辉"},{"id":124,"name":"游戏网销售部-明玉敬"},{"id":125,"name":"游戏网销售部-王琤"},{"id":126,"name":"游戏网销售部-程诚"},{"id":127,"name":"游戏网销售部-郑薇薇"},{"id":128,"name":"电脑网编辑部-付涛"},{"id":129,"name":"电脑网编辑部-冉广"},{"id":130,"name":"电脑网编辑部-刘晓辉"},{"id":131,"name":"电脑网编辑部-尤飞龙"},{"id":132,"name":"电脑网编辑部-左键"},{"id":133,"name":"电脑网编辑部-李懿"},{"id":134,"name":"电脑网编辑部-李捷"},{"id":135,"name":"电脑网编辑部-杨涛"},{"id":136,"name":"电脑网编辑部-柳杨"},{"id":137,"name":"电脑网编辑部-熊雪辉"},{"id":138,"name":"电脑网编辑部-王丞"},{"id":139,"name":"电脑网编辑部-王君"},{"id":140,"name":"电脑网编辑部-王明达"},{"id":141,"name":"电脑网编辑部-王首立"},{"id":142,"name":"电脑网编辑部-盛永振"},{"id":143,"name":"电脑网编辑部-贺杰"},{"id":144,"name":"电脑网编辑部-陈占伟"},{"id":145,"name":"电脑网编辑部-陈志"},{"id":146,"name":"电脑网编辑部-黄星"},{"id":147,"name":"电脑网销售部厂商组-于园园"},{"id":148,"name":"电脑网销售部厂商组-依茜"},{"id":149,"name":"电脑网销售部厂商组-关悦"},{"id":150,"name":"电脑网销售部厂商组-刘嘉玉"},{"id":151,"name":"电脑网销售部厂商组-刘惠"},{"id":152,"name":"电脑网销售部厂商组-刘阳"},{"id":153,"name":"电脑网销售部厂商组-周艺颖"},{"id":154,"name":"电脑网销售部厂商组-姜文倩"},{"id":155,"name":"电脑网销售部厂商组-庄英"},{"id":156,"name":"电脑网销售部厂商组-张丽媛"},{"id":157,"name":"电脑网销售部厂商组-张影"},{"id":158,"name":"电脑网销售部厂商组-张杉"},{"id":159,"name":"电脑网销售部厂商组-张莹"},{"id":160,"name":"电脑网销售部厂商组-徐霏"},{"id":161,"name":"电脑网销售部厂商组-李斯"},{"id":162,"name":"电脑网销售部厂商组-李旎"},{"id":163,"name":"电脑网销售部厂商组-杨璟瑜"},{"id":164,"name":"电脑网销售部厂商组-王然"},{"id":165,"name":"电脑网销售部厂商组-申妮妮"},{"id":166,"name":"电脑网销售部厂商组-莫莉"},{"id":167,"name":"电脑网销售部厂商组-董嘉"},{"id":168,"name":"电脑网销售部厂商组-赵丹丹"},{"id":169,"name":"电脑网销售部厂商组-赵云燕"},{"id":170,"name":"电脑网销售部厂商组-赵劼"},{"id":171,"name":"电脑网销售部厂商组-赵思蕤"},{"id":172,"name":"电脑网销售部厂商组-郝倩"},{"id":173,"name":"电脑网销售部厂商组-郭沛林"},{"id":174,"name":"电脑网销售部厂商组-郭潇"},{"id":175,"name":"电脑网销售部厂商组-陆舒舒"},{"id":176,"name":"电脑网销售部厂商组-马羽"},{"id":177,"name":"电脑网销售部厂商组-马超"},{"id":178,"name":"电脑网销售部厂商组-高新"},{"id":179,"name":"电脑网销售部厂商组-高翔"},{"id":180,"name":"电脑网销售部渠道组-屈宁波"},{"id":181,"name":"电脑网销售部渠道组-曲洋洋"},{"id":182,"name":"电脑网销售部渠道组-杨杨"},{"id":183,"name":"电脑网销售部渠道组-武利坤"},{"id":184,"name":"电脑网销售部渠道组-沙圆圆"},{"id":185,"name":"电脑网销售部渠道组-渠志伟"},{"id":186,"name":"电脑网销售部渠道组-邵政淇"},{"id":187,"name":"电脑网销售部渠道组-郭珺"},{"id":188,"name":"电脑网销售部渠道组-陈玉雪"},{"id":189,"name":"管理部-张志才"},{"id":190,"name":"管理部-施容"},{"id":191,"name":"管理部-李靖"},{"id":192,"name":"管理部-牛海洋"},{"id":193,"name":"管理部-胡宛乔"},{"id":194,"name":"管理部-陈文珍"},{"id":195,"name":"管理部-韩合法"},{"id":196,"name":"行政部-刘永贵"},{"id":197,"name":"行政部-孙彦萍"},{"id":198,"name":"行政部-张卫宾"},{"id":199,"name":"行政部-徐帆"},{"id":200,"name":"行政部-李爽"},{"id":201,"name":"行政部-王晓俊"},{"id":202,"name":"行政部-王晓媛"},{"id":203,"name":"行政部-董丽华"},{"id":204,"name":"行政部-陈国祥"},{"id":205,"name":"财务部-汤以欣"},{"id":206,"name":"财务部-王艳春"},{"id":207,"name":"财务部-贾云莉"},{"id":208,"name":"财务部-赵艳红"},{"id":209,"name":"资金部-张卫平"},{"id":210,"name":"资金部-张静"},{"id":211,"name":"资金部-李国侠"},{"id":212,"name":"资金部-王海莲"}],
			ext = ".jpg",
			path = "players/",
			result = [];

			for (var i = 0, l = data.length; i < l; i++) {
				result.push({"id": data[i]["id"], "src": path + data[i]["name"] + ext});
			}

			return result;
		})(),
*/
		positions: [
			// "P"
			"-4400px, 0px, 0px",
			"-4200px, 0px, 0px",
			"-4400px, 200px, 0px",
			"-4200px, 200px, 0px",
			"-4400px, 400px, 0px",
			"-4200px, 400px, 0px",
			"-4400px, 600px, 0px",
			"-4200px, 600px, 0px",
			"-4400px, 800px, 0px",
			"-4200px, 800px, 0px",
			"-4400px, 1000px, 0px",
			"-4200px, 1000px, 0px",
			"-4400px, 1200px, 0px",
			"-4200px, 1200px, 0px",
			"-4400px, 1400px, 0px",
			"-4200px, 1400px, 0px",

			"-4000px, 0px, 0px",
			"-4000px, 200px, 0px",
			"-3800px, 0px, 0px",
			"-3800px, 200px, 0px",
			"-3600px, 0px, 0px",
			"-3600px, 200px, 0px",
			"-3400px, 100px, 0px",
			"-3400px, 300px, 0px",
			"-3200px, 200px, 0px",
			"-3200px, 400px, 0px",
			"-3200px, 600px, 0px",
			"-3200px, 800px, 0px",
			"-3400px, 700px, 0px",
			"-3400px, 900px, 0px",
			"-3600px, 800px, 0px",
			"-3600px, 1000px, 0px",
			"-3800px, 800px, 0px",
			"-3800px, 1000px, 0px",
			"-4000px, 800px, 0px",
			"-4000px, 1000px, 0px",

			// "C"
			"-1600px, 300px, 0px",
			"-1700px, 100px, 0px",
			"-1800px, 300px, 0px",
			"-1900px, 100px, 0px",
			"-2100px, 0px, 0px",
			"-2300px, 0px, 0px",
			"-2500px, 100px, 0px",
			"-2700px, 100px, 0px",
			"-2800px, 300px, 0px",
			"-2600px, 300px, 0px",
			"-2900px, 500px, 0px",
			"-2700px, 500px, 0px",
			"-2900px, 700px, 0px",
			"-2700px, 700px, 0px",
			"-2900px, 900px, 0px",
			"-2700px, 900px, 0px",
			"-2800px, 1100px, 0px",
			"-2600px, 1100px, 0px",
			"-2700px, 1300px, 0px",
			"-2500px, 1300px, 0px",
			"-2300px, 1400px, 0px",
			"-2100px, 1400px, 0px",
			"-1900px, 1300px, 0px",
			"-1700px, 1300px, 0px",
			"-1800px, 1100px, 0px",
			"-1600px, 1100px, 0px",

			// "G"
			"-400px, 500px, 0px",
			"-600px, 400px, 0px",
			"-800px, 400px, 0px",
			"-1000px, 500px, 0px",
			"-1200px, 600px, 0px",
			"-1300px, 800px, 0px",
			"-1300px, 1000px, 0px",
			"-1200px, 1200px, 0px",
			"-1000px, 1300px, 0px",
			"-800px, 1400px, 0px",
			"-600px, 1400px, 0px",
			"-400px, 1300px, 0px",
			"-400px, 1100px, 0px",
			"-400px, 900px, 0px",
			"-600px, 900px, 0px",
			"-800px, 900px, 0px",

			// "R"
			"-100px, 400px, 0px",
			"-100px, 600px, 0px",
			"-100px, 800px, 0px",
			"-100px, 1000px, 0px",
			"-100px, 1200px, 0px",
			"-100px, 1400px, 0px",

			"100px, 400px, 0px",
			"300px, 400px, 0px",
			"500px, 500px, 0px",
			"600px, 700px, 0px",
			"500px, 900px, 0px",
			"300px, 1000px, 0px",
			"100px, 1000px, 0px",

			"400px, 1200px, 0px",
			"600px, 1400px, 0px",

			// "O"
			"1400px, 400px, 0px",
			"1200px, 500px, 0px",
			"1000px, 700px, 0px",
			"900px, 900px, 0px",
			"1000px, 1100px, 0px",
			"1200px, 1300px, 0px",
			"1400px, 1400px, 0px",
			"1600px, 1300px, 0px",
			"1800px, 1100px, 0px",
			"1900px, 900px, 0px",
			"1800px, 700px, 0px",
			"1600px, 500px, 0px",

			// "U"
			"2200px, 600px, 0px",
			"2200px, 800px, 0px",
			"2200px, 1000px, 0px",
			"2200px, 1200px, 0px",
			"2300px, 1300px, 0px",
			"2500px, 1400px, 0px",
			"2700px, 1400px, 0px",
			"2900px, 1300px, 0px",
			"3000px, 1200px, 0px",
			"3000px, 1000px, 0px",
			"3000px, 800px, 0px",
			"3000px, 600px, 0px",

			// "P"
			"3300px, 400px, 0px",
			"3300px, 600px, 0px",
			"3300px, 800px, 0px",
			"3300px, 1000px, 0px",
			"3300px, 1200px, 0px",
			"3300px, 1400px, 0px",

			"3500px, 400px, 0px",
			"3700px, 400px, 0px",
			"3900px, 400px, 0px",
			"4000px, 500px, 0px",
			"4100px, 600px, 0px",
			"4100px, 800px, 0px",
			"4000px, 900px, 0px",
			"3900px, 1000px, 0px",
			"3700px, 1000px, 0px",
			"3500px, 1000px, 0px",

			// "cube"
			"2600px, 600px, 0px",
			"2400px, 400px, 0px",
			"2600px, 400px, 0px",
			"2800px, 400px, 0px",
			"3000px, 200px, 0px",
			"2800px, 200px, 0px",
			"2600px, 200px, 0px",
			"2400px, 200px, 0px",
			"2200px, 200px, 0px",
			"2000px, 0px, 0px",
			"2200px, 0px, 0px",
			"2400px, 0px, 0px",
			"2600px, 0px, 0px",
			"2800px, 0px, 0px",
			"3000px, 0px, 0px",
			"3200px, 0px, 0px",
			"3200px, -200px, 0px",
			"3000px, -200px, 0px",
			"2800px, -200px, 0px",
			"2600px, -200px, 0px",
			"2400px, -200px, 0px",
			"2200px, -200px, 0px",
			"2000px, -200px, 0px",
			"2000px, -400px, 0px",
			"2200px, -400px, 0px",
			"2400px, -400px, 0px",
			"2600px, -400px, 0px",
			"2800px, -400px, 0px",
			"3000px, -400px, 0px",
			"3200px, -400px, 0px",
			"3200px, -600px, 0px",
			"3000px, -600px, 0px",
			"2800px, -600px, 0px",
			"2600px, -600px, 0px",
			"2400px, -600px, 0px",
			"2200px, -600px, 0px",
			"2000px, -600px, 0px",
			"2200px, -800px, 0px",
			"2400px, -800px, 0px",
			"2600px, -800px, 0px",
			"2800px, -800px, 0px",
			"3000px, -800px, 0px",
			"2800px, -1000px, 0px",
			"2600px, -1000px, 0px",
			"2400px, -1000px, 0px",
			"2600px, -1200px, 0px"
		],
		src: "images/item.jpg",
		total: 100,
		winner: function(callback, award) {
/*
			$.ajax({
				type: "POST",
				url: "ajax.jsp",
				data: {
					"method": "lucky",
					"award": award
				},
				dataType: "json",
				success: function(data) {
*/
					var
					data = {"id": 1, "name": "winner"},
					ext = ".jpg",
					path = "";

					callback({"id": data["id"], "src": path + data["name"] + ext});

/*
					callback({"id": data["id"], "src": data["src"]});
				}
			});
*/
		}
	});

//});
